Repository: jehy/wp-noexternallinks
Catalog: tags/3.5.18/lang/wp-noexternallinks-*.po
Languages: ru_ru

source: Link masking for this post
ru_ru: Настройка маскировки ссылок для этого поста

source: Use default policy from plugin settings
ru_ru: Использовать настройки маскировки по умолчанию

source: Don`t mask links
ru_ru: Не маскировать ссылки

source: Options updated.
ru_ru: Настройки обновлены.

source: View options
ru_ru: Настройки

source: View Stats
ru_ru: Статистика

source: Feedback
ru_ru: Обратная связь

source: Donate
ru_ru: Пожертвовать

source: Statistic for plugin is disabled! Please, go to options page and enable it via checkbox "Log all outgoing clicks".
ru_ru: Статистика для плагина отключена. Пожалуйста, зайдите в настройки и установите галочку "Вести статистику по кликам на внешние ссылки".

source: View stats from
ru_ru: Посмотреть статистику от

source: to
ru_ru: до

source: View
ru_ru: Смотреть

source: No statistic for given period.
ru_ru: За указанный период времени статистики не найдено.

source: That plugins allows you to mask all external links and make them internal or hidden - using PHP redirect or special link tags and attributes. Yeah, by the way - it does not change anything in the base - only replaces links on output. If you disabled this plugin and still have links masked - it is your caching plugin`s fault!
ru_ru: Этот плагин позволяет вам маскировать внешние ссылки и делать их внутренними или прятать - при помощи перенаправлений или специальных тагов и атрибутов. Он ничего не меняет в базе блога, только перехватывает и редактирует вывод пользователю. Если вы отключили этот плагин, а ваши ссылки всё ещё маскируются - скорее всего, это связано с вашим кеширующим плагином!

source: If you need to make custom modifications for plugin - you can simply extend it, according to
ru_ru: Если вам требуется сделать модификации в работе плагина - просто расширьте его по примеру

source: this article.
ru_ru: этой статьи

source: If you need to mask links in posts`s custom field, take a look at
ru_ru: Если вам требуется маскировать ссылки из произвольных полей постов, сделайте это по примеру

source: Global links masking settings
ru_ru: Глобальные настройки маскировки ссылок

source: You can also disable plugin on per-post basis
ru_ru: Так же вы можете отключить плагин для конкретных постов

source: Choose masking type
ru_ru: Выберите тип маскировки

source: Default masking type is via 302 redirects. Please choose one of the following mods if you do not like it:
ru_ru: По умолчанию, при маскировке используются 302е редиректы. Пожалуйста, выберите один из вариантов ниже, если вас это не устраивает:

source: What to mask
ru_ru: Что маскировать

source: What to exclude from masking
ru_ru: Что не маскировать

source: Common configuration
ru_ru: Общие настройки

source: Link encoding
ru_ru: Шифрование ссылок

source: Those options are not secure enough if you want to protect your data from someone but are quite enough to make link not human-readable. Please choose one of them:
ru_ru: Эти виды шифрования небезопасно, если вы хотите защитить от кого-то данные, но его вполне хватает, чтобы сделать ссылку нечитаемой для человека.

source: Configuration for javascript redirects (if enabled)
ru_ru: Настройки редиректа через яваскрипт (если он выбран)

source: Save Changes
ru_ru: Сохранить измения

source: Failed to make masked link. MySQL link table does not exist. Trying to create table.
ru_ru: Не удалось сохранить маску ссылки. Таблица MySQL не существует. Попытаемся её создать.

source: Failed to create table. Please, check mysql permissions.
ru_ru: Не удалось создать таблицу. Пожалуйста, проверьте полномочия MySQL.

source: Failed SQL:
ru_ru: SQL запрос, вызвавший ошибку:

source: Error was:
ru_ru: Ошибка была:

source: Table created.
ru_ru: Таблица создана.

source: Redirecting...
ru_ru: Перенаправляю...

source: You have been redirected through this website from a suspicious source. We prevented it and you are going to be redirected to our
ru_ru: Вас перенеправили по этой сссылке из подозрительного источника. Мы предотвратили переход, и вы будете перенаправлены на наш

source: safe web site.
ru_ru: безопасный веб сайт.

source: Failed to save statistic data. Trying to create table.
ru_ru: Не удалось сохранить статистику. Пытаюсь создать таблицу.

source: You were going to the redirect link, but something did not work properly.<br>Please, click
ru_ru: Вы должны были быть перенаправлены по ссылке, но что-то не получилось.<br> Пожалуйста, нажмите

source: HERE
ru_ru: СЮДА

source: to go to
ru_ru: чтобы перейти по ссылке

source: manually.
ru_ru: вручную.

source: Sorry, no url redirect specified. Can`t complete request.
ru_ru: Не был определён адрес, невозможно перенаправить.

source: Can not get output buffer!
ru_ru: Не получилось установить контроль над буфером вывода!

source: WP_NoExternalLinks Can`t use output buffer. Please, disable full masking and use other filters.
ru_ru: WP NoExternalLinks не удалось использовать буфер вывода wordpress. Пожалуйста, выключите опцию полной маскировки ссылок в настройках плагина и используйте другие опции.

source: Output buffer empty!
ru_ru: Буфер вывода пуст!

source: Failed to update options!
ru_ru: Не удалось обновить настройки!

source: Mask links in posts and pages
ru_ru: Маскировать ссылки в постах и на страницах

source: Mask links in comments
ru_ru: Маскировать ссылки в комментариях

source: Mask comments authors`s homepage links
ru_ru: Маскировать ссылки авторов комментариев на свои страницы

source: Mask links in your RSS post content
ru_ru: Маскировать ссылки в ваших постах в RSS

source: (may result in invalid RSS if used with some masking options)
ru_ru: (может привести к невалидному RSS при использованию некоторых настроек маскировки ссылок)

source: Mask links in RSS comments
ru_ru: Маскировать ссылки в комментариях в RSS

source: Add <b>rel=nofollow</b> for masked links (for google)
ru_ru: Добавлять <b>rel=nofollow</b> в маскируемые ссылки (для google)

source: Add <b>target="blank"</b> for all links to other sites (links will open in new window)
ru_ru: Добавлять <b>target="blank"</b> для всех ссылок на другие сайты (ссылки будут открываться в новом окне)

source: Surround masked links with <b>&lt;noindex&gt;link&lt;/noindex&gt;</b> tag (for yandex search engine)
ru_ru: Окружать маскируемые ссылки тегом <b>&lt;noindex&gt;link&lt;/noindex&gt;</b> (для яндекса)

source: Surround masked links with comment <b>&lt;!--noindex--&gt;link&lt;!--/noindex--&gt;</b> (for yandex search engine, better then noindex tag because valid)
ru_ru: Окружать маскируемые ссылки комментарием <b>&lt;!--noindex--&gt;link&lt;!--/noindex--&gt;</b> (для яндекса, это лучшая альтернатива тегу noindex, поскольку HTML остаётся валидным)

source: No redirect
ru_ru: Не использовать редирект

source: Link separator for redirects (default="goto")
ru_ru: Разделитель ссылок для редиректа (по молчанию = "goto")

source: Exclude URLs that you don`t want to mask (all urls, beginning with those, won`t be masked). Put one adress on each line, including protocol prefix (for example,
ru_ru: Укажите адреса, которые вы не хотите маскировать - все адреса, начинающиеся с указанных, не будут маскированы. По одному на каждой строчке (например,

source: or
ru_ru: или

source: Skype, javascript and mail links are excluded by default. To exclude full protocol, just add line with it`s prefix - for example,
ru_ru: Ссылки на скайп, яваскрипт и почту уже исключены из маскировки. Чтобы исключить весь протокол, добавьте строчку с его префиксом - например,

source: Mask ALL links in document (can slow down your blog and conflict with some cache and other plugins. Not recommended).
ru_ru: Маскировать ВСЕ ссылки в документе (может замедлить ваш блог и конфликтовать с кеширующими плагинами. Не рекомендуется).

source: Log all outgoing clicks.
ru_ru: Логировать все исходящие клики.

source: Days to keep clicks stats
ru_ru: Время (в днях) хранения статистики по кликам

source: Use javascript redirect
ru_ru: Использовать яваскриптовый редирект

source: Redirect time (seconds)
ru_ru: Время редиректа (в секундах)

source: Custom redirect text. Use word "LINKURL" where you want to use redirect url. For example, <b>CLICK &lt;a href="LINKURL"&gt;HERE NOW&lt;/a&gt;</b>
ru_ru: Свой текст редиректа. Используйте слово "LINKURL" где должен быть адрес. Например, <b>НАЖМИ &lt;a href="LINKURL"&gt;СЮДА ПРЯМО СЕЙЧАС&lt;/a&gt;</b>

source: Do not mask links when registered users visit site
ru_ru: Не маскировать ссылки при выдаче сайта зарегистрированным пользователям

source: Mask url with special numeric code. Be careful, this option may slow down your blog.
ru_ru: Маскировать ссылки цифровым кодом. Осторожно, это может замедлить ваш блог.

source: Completely remove links from your posts. Someone needed it...
ru_ru: Полностью удалить ссылки из постов. Кому-то было нужно...

source: Turn all links into text. For perverts.
ru_ru: Превратить все ссылки в текст. Опция для извращенцев.

source: Use base64 encoding for links.
ru_ru: Кодировать ссылки при помощи base64.

source: Debug mode (Adds comments lines like "&lt;!--wp-noexternallinks debug: some info--&gt;" to output. For testing only!)
ru_ru: Режим отладки (Добавляет комментарии HTML вроде "&lt;!--wp-noexternallinks debug: какая-то информация--&gt;"). Не должен быть использован в нормальном режиме работы.

source: Check for document referer and restrict redirect if it is not your own web site. Useful against spoofing attacks. User will be redirected to main page of your web site.
ru_ru: Проверять адрес, с которого пришёл пользователь, и зарпещать переход в случае, если он пришёл не с вашего веб сайта. Это защита от атак с подменой адреса. Пользователи будут перенаправлены на главную страницу вашего сайта.

source: Do not mask links which have <b>rel="follow"</b> atribute and are posted by admin
ru_ru: Не маскировать сссылки с атрибутом <b>rel="follow"</b>, написанные администратором

source: Custom parser file found but <b>custom_parser</b> class not defined!
ru_ru: Найден файл расширения плагина, но класс <b>custom_parser</b> не определён!
