Repository: jehy/wp-noexternallinks
Catalog: lang/wpnoexternallinks-*.po
Languages: es_es

source: Link masking for this post
es_es: Enmascarar links para esta entrada

source: Use default policy from plugin settings
es_es: Usa por defecto los ajustes del plugin

source: Don`t mask links
es_es: No enmascarar los enlaces

source: Plugin home page
es_es: Web oficial del plugin

source: View options
es_es: Ver opciones

source: Statistic for plugin is disabled! Please, go to options page and enable it via checkbox "Log all outgoing clicks".
es_es: ¡Las estadísticas del plugin están desactivadas! Por favor, ve a la página de opciones y activalas marcando la casilla "Registra todos los clicks salientes".

source: View stats from
es_es: Ver las estadísticas de

source: to
es_es: a

source: View
es_es: Ver

source: No statistic for given period.
es_es: No hay estadísticas para este periodo de tiempo

source: That plugins allows you to mask all external links and make them internal or hidden - using PHP redirect or special link tags and attributes. Yeah, by the way - it does not change anything in the base - only replaces links on output.<br>P.S. It doesn`t mask internal and excluded links.
es_es: Este plugin te permite enmascarar todos los enlaces externos y convertirlos en internos u ocultos - usando redirección PHP o etiquetas y atributos de enlaces. No hace ningún cambio en la base de datos sólo replaza enlaces salientes. <br>P.D. No enmascara enlaces internos y excluidos.

source: View Stats
es_es: Ver estadísticas

source: <h3>Global links masking settings</h3>(You can also disable plugin on per-post basis)
es_es: <h3>Ajustes globales de enmascarado de enlaces</h3>(Puedes desactivar el plugin en cada entrada)

source: Save Changes
es_es: Guarda cambios

source: Failed to make masked link. Trying to create table.
es_es: Fallo al enmascarar enlace. Tratando de crear tabla.

source: Failed to create table. Please, check mysql permissions.
es_es: Fallo al crear tabla. Por favor comprueba los permisos de mysql.

source: Table created.
es_es: Tabla creada.

source: Failed to save statistic data. Trying to create table.
es_es: Fallo al guardar estadísticas. Tratando de crear tabla.

source: Redirecting...
es_es: Redireccionando...

source: You were going to the redirect link, but something did not work properly.<br>Please, click
es_es: Estabas siendo redirigido al enlace, pero algo no salió correctamente. <br>Por favor, haz click

source: HERE
es_es: AQUÍ

source: to go to
es_es: para ir a

source: manually.
es_es: manualmente.

source: Sorry, no url redirect specified. Can`t complete request.
es_es: Lo siento, url de redirección no especificada. No se puede cumplir la petición.

source: Can not get output buffer!
es_es: ¡No se pudo otener buffer saliente!

source: WP_NoExternalLinks Can`t use output buffer. Please, disable full masking and use other filters.
es_es: WP_NoExternalLinks no puede utilizar el buffer saliente. Por favor, desactiva el enmascarado completo y usa otros filtros.

source: Output buffer empty!
es_es: ¡Buffer saliente vacío!

source: Failed to update options!
es_es: ¡Fallo al actualizar opciones!

source: Mask links in your posts
es_es: Enmascara enlaces en las entradas

source: Mask links in comments
es_es: Enmascara enlaces en comentarios.

source: Mask comments authors`s links
es_es: Enmascara los enlaces de los autores de los comentarios.

source: Add <b>rel=nofollow</b> for masked links (for google)
es_es: Añade <b>rel=nofollow</b> a los enlaces enmascarados (para Google)

source: Add <b>target="blank"</b> for all links to other sites (links will open in new window)
es_es: Añade <b>target="blank"</b> para todos los enlaces a otras páginas (los enlaces se abrirán en una ventana nueva)

source: Surround masked links with <b>&lt;noindex&gt;link&lt;/noindex&gt;</b> tag (for yandex search engine)
es_es: Envuelve los enlaces enmascarados con la etiqueta <b>&lt;noindex&gt;link&lt;/noindex&gt;</b> (para el buscador Yandex)

source: Disable url rewrite of all links (you can be OK with just <b>noindex</b> tag and <b>rel=nofollow</b>)
es_es: Desactiva reescritura de url de todos los enlaces (puede que te sirva con sólo la etiqueta <b>noindex</b> y <b>rel=nofollow</b>)

source: Link separator (default="goto")
es_es: Separador en los enlaces (por defecto="goto")

source: Exclude URLs that you don`t want to mask (all urls, beginning with those, won`t be masked). Put one adress on each line, including prefix (for example, "http://jehy.ru")
es_es: Excluye urls que no quieras enmascarar (todas las que empien por esto, no se enmascararán). Pon una dirección en cada línea, incluyendo prefijo. (por ejemplo, "http://jehy.ru")

source: Mask ALL links in document (can slow down your blog and conflict with some cache and other plugins. Please use it on your own risk.
es_es: Enmascara TODOS los enlaces (puede ralentizar tu blog y crear conflicto con la caché y otros plugins. Por favor usalo bajo tu propio riesgo)

source: Log all outgoing clicks
es_es: Registra todos los clicks salientes

source: Days to keep clicks stats
es_es: Dias para guardar las estadísticas de clicks

source: Do not use 302 redirect, only javascript redirect
es_es: No usar redirección 302, sólo redirección por javascript

source: Redirect time (seconds) when using javascript redirect instead of 302
es_es: Tiempo de redirección (en segundos) cuando usas redirección por javascript, en vez de redirección 302

source: Custom redirect text (if 302 redirects disabled). Use word "LINKURL" where you want to use redirect url. For example, <b>CLICK &lt;a href="LINK"&gt;HERE NOW&lt;/a&gt;</b>
es_es: Texto de redirección personalizado (si está desactivada la redirección 302). Usa la palabra "URLDELENLACE" dónde quieras usar la url de redirección. Por ejemplo, <b>CLICK &lt;a href="URLDELENLACE"&gt;AQUÍ Y AHORA &lt;/a&gt;</b>

source: Do not mask links when registered users visit site
es_es: No enmascarar enlaces cuando usuarios registrados visitan la página

source: Mask url with special numeric code. Be careful, this option may slow down your blog. Option is design for easy and quick personal use, it is not secure enough for commercial plans.
es_es: Enmascara urls con un código numérico específico. Ten cuidado esta opción puede ralentizar tu blog. La opción está diseñada para un uso personal rápido y sencillo, no es lo suficientemente seguro usarla para usos comerciales.

source: Completely remove links from your posts. Someone needed it...
es_es: Elimina completamente los enlaces de tus entradas. Puede que alguien necesite esta opción...

source: Turn all links into text. For perverts.
es_es: Convierte todos los enlaces en texto plano.

source: Use base64 encoding for links (no need for special mysql table but no stats).
es_es: Usa codificación de base64 para enlaces (no necesita tblas especiales de mysql, pero no permite estadísticas)

source: Debug mode (Adds comments lines like "&lt;!--wpnoexternallinks debug: some info--&gt;" to output. For testing only!)
es_es: Modo debug (Añade lineas de comentario cómo "&lt;!--wpnoexternallinks debug: some info--&gt;" a enlaces salientes. ¡Sólo para pruebas!)
