Repository: jehy/wp-noexternallinks
Catalog: tags/3.3.9.1/lang/wpnoexternallinks-*.po
Languages: ru_ru

source: Link masking for this post
ru_ru: Настройка маскировки ссылок для этого поста

source: Use default policy from plugin settings
ru_ru: Использовать настройки маскировки по умолчанию

source: Don`t mask links
ru_ru: Не маскировать ссылки

source: Plugin home page
ru_ru: Страница плагина

source: Feedback
ru_ru: Проблемы?

source: View options
ru_ru: Настройки

source: Statistic for plugin is disabled! Please, go to options page and enable it via checkbox "Log all outgoing clicks".
ru_ru: Статистика для плагина отключена. Пожалуйста, зайдите в настройки и установите галочку "Вести статистику по кликам на внешние ссылки".

source: View stats from
ru_ru: Просмотреть статистику с

source: to
ru_ru: до

source: View
ru_ru: Смотреть

source: No statistic for given period.
ru_ru: За указанный период времени статистики не найдено.

source: That plugins allows you to mask all external links and make them internal or hidden - using PHP redirect or special link tags and attributes. Yeah, by the way - it does not change anything in the base - only replaces links on output.<br>P.S. It doesn`t mask internal and excluded links.
ru_ru: Этот плагин позволяет маскировать все внешние ссылки и делать их внутренними или прятать, используя специальные редиректы и атрибуты. Между прочим, в базе он ничего не правит - вся замена производится только при выдаче документа пользователю. Плагин не маскирует внутренние а так же исключённые из маскировки ссылки.

source: View Stats
ru_ru: Статистика

source: <h3>Global links masking settings</h3>(You can also disable plugin on per-post basis)
ru_ru: <h3>Общие настройки плагина</h3>(Так же можно указать индивидуальные для каждого поста)

source: Save Changes
ru_ru: Сохранить измения

source: Failed to make masked link. Trying to create table.
ru_ru: Не удалось сохранить маску ссылки. Пытаемся создать таблицу ссылок.

source: Failed to create table. Please, check mysql permissions.
ru_ru: Не удалось создать таблицу. Пожалуйста, проверьте полномочия MySQL.

source: Failed SQL:
ru_ru: SQL запрос, вызвавший ошибку:

source: Error was:
ru_ru: Ошибка была:

source: Table created.
ru_ru: Таблица создана.

source: Failed to save statistic data. Trying to create table.
ru_ru: Не удалось сохранить статистику. Пытаюсь создать таблицу.

source: Redirecting...
ru_ru: Перенаправляю...

source: You were going to the redirect link, but something did not work properly.<br>Please, click
ru_ru: Вы должны были быть перенаправлены по ссылке, но что-то не получилось.<br> Пожалуйста, нажмите

source: HERE
ru_ru: СЮДА

source: to go to
ru_ru: чтобы перейти по ссылке

source: manually.
ru_ru: вручную.

source: Sorry, no url redirect specified. Can`t complete request.
ru_ru: Не был определён адрес, невозможно перенаправить.

source: Can not get output buffer!
ru_ru: Не получилось установить контроль над буфером вывода!

source: WP_NoExternalLinks Can`t use output buffer. Please, disable full masking and use other filters.
ru_ru: WP NoExternalLinks не удалось использовать буфер вывода wordpress. Пожалуйста, выключите опцию полной маскировки ссылок в настройках плагина и используйте другие опции.

source: Output buffer empty!
ru_ru: Буфер вывода пуст!

source: Failed to update options!
ru_ru: Не удалось обновить настройки!

source: Mask links in your posts
ru_ru: Маскировать ссылки в постах

source: Mask links in comments
ru_ru: Маскировать ссылки в комментариях

source: Mask comments authors`s links
ru_ru: Маскировать ссылки комментаторов

source: Add <b>rel=nofollow</b> for masked links (for google)
ru_ru: Добавлять <b>rel=nofollow</b> в маскируемые ссылки (для google)

source: Add <b>target="blank"</b> for all links to other sites (links will open in new window)
ru_ru: Добавлять <b>target="blank"</b> для всех ссылок на другие сайты (ссылки будут открываться в новом окне)

source: Surround masked links with <b>&lt;noindex&gt;link&lt;/noindex&gt;</b> tag (for yandex search engine)
ru_ru: Окружать маскируемые ссылки тегом <b>&lt;noindex&gt;link&lt;/noindex&gt;</b> (для яндекса)

source: Disable url rewrite of all links (you can be OK with just <b>noindex</b> tag and <b>rel=nofollow</b>)
ru_ru: Не маскировать ссылки при помощи редиректов

source: Link separator (default="goto")
ru_ru: Разделитель ссылок (по умолчанию "goto")

source: Exclude URLs that you don`t want to mask (all urls, beginning with those, won`t be masked). Put one adress on each line, including prefix (for example, "http://jehy.ru")
ru_ru: Укажите адреса, которые вы не хотите маскировать - все адреса, начинающиеся с указанных, не будут маскированы. По одному на каждой строчке (например, "http://jehy.ru")

source: Mask ALL links in document (can slow down your blog and conflict with some cache and other plugins. Please use it on your own risk.
ru_ru: Маскировать ВСЕ ссылки на страницах (учтите, это может замедлить работу вашего блога и вызвать конфликт с некоторыми другими плагинами. Используйте на свой страх и риск.)

source: Log all outgoing clicks
ru_ru: Вести статистику по кликам на внешние ссылки

source: Days to keep clicks stats
ru_ru: Время (в днях) хранения статистики по кликам

source: Do not use 302 redirect, only javascript redirect
ru_ru: Не использовать редиректы с 302 заголовками, только яваскрипт

source: Redirect time (seconds) when using javascript redirect instead of 302
ru_ru: Время (в секундах), через которое произойдёт перенаправление пользователя при отключенных 302

source: Custom redirect text (if 302 redirects disabled). Use word "LINKURL" where you want to use redirect url. For example, <b>CLICK &lt;a href="LINK"&gt;HERE NOW&lt;/a&gt;</b>
ru_ru: Свой текст редиректа, если 302 отключены. Используйте слово "LINKURL" там, где должен быть адрес для перехода. Например, так: <b>ЖМИ &lt;a href="LINKURL"&gt;СЮДА&lt;/a&gt;</b>

source: Do not mask links when registered users visit site
ru_ru: Не маскировать ссылки при выдаче сайта зарегистрированным пользователям

source: Mask url with special numeric code. Be careful, this option may slow down your blog. Option is design for easy and quick personal use, it is not secure enough for commercial plans.
ru_ru: Маскировать ссылки цифровым кодом. Осторожно, данная опция может замедлить скорость вашего блога. Она оптимизирована для быстрого выполнения на личном веб сайте и не обладает достаточной защищённостью для коммерческих систем.

source: Completely remove links from your posts. Someone needed it...
ru_ru: Полностью удалить ссылки из постов. Кому-то было нужно...

source: Turn all links into text. For perverts.
ru_ru: Превратить все ссылки в текст. Опция для извращенцев.

source: Use base64 encoding for links (no need for special mysql table but no stats).
ru_ru: Кодировать ссылки в base64 (не требует отдельной mysql таблицы, но и не будет собирать статистику переходов)

source: Debug mode (Adds comments lines like "&lt;!--wpnoexternallinks debug: some info--&gt;" to output. For testing only!)
ru_ru: Режим отладки (Добавляет в код клмментарии типа "&lt;!--wpnoexternallinks debug: some info--&gt;" . Только для тестирования!)
